In [83]:
from sklearn.metrics import mean_absolute_error, mean_squared_error

y = [85, 45, 75]
y_h = [64, 12, 95]

mse = mean_squared_error(y, y_h)
mae = mean_absolute_error(y, y_h)
print('MSE:', mse)
print('MAE:', mae)

MSE: 643.3333333333334
MAE: 24.666666666666668

In [84]:
y = [85, 45, 75, 738]
y_h = [64, 12, 95, 65]

mse1 = mean_squared_error(y, y_h)
mae1 = mean_absolute_error(y, y_h)

print('MSE:', mse1)
print('MAE:', mae1)

MSE: 113714.75
MAE: 186.75

In [85]:
import numpy as np
import pandas as pd
y = np.random.randint(1, 30, size = 10)
y_hat = np.random.randint(1, 30, size = 10)

In [86]:
df = pd.DataFrame({
    'y' : y,
    'y_h' : y_hat
})

In [87]:
df

    y  y_h
0  22   21
1  11    1
2  15   28
3  11   20
4  18   23
5   1   11
6  13   29
7  12    2
8  22    7
9   6    3

In [88]:
Adf = pd.DataFrame({
    'y':y,
    'y_hat': y_hat,
    'MSE' : (y-y_hat) **2,
    'MAE': np.abs(y-y_hat)

})

In [89]:
Adf

    y  y_hat  MSE  MAE
0  22     21    1    1
1  11      1  100   10
2  15     28  169   13
3  11     20   81    9
4  18     23   25    5
5   1     11  100   10
6  13     29  256   16
7  12      2  100   10
8  22      7  225   15
9   6      3    9    3

In [90]:
 mean_squared_error(y, y_hat)

106.6

In [91]:
mean_absolute_error(y, y_hat)

9.2